/*******************************************************************
** 文件名:	INetEntity.cs
** 版  权:	(C) 深圳冰川网络网络科技有限公司
** 创建人:	郑秀程
** 日  期:	2024/5/21 15:35:30
** 版  本:	1.0
** 描  述:	网络实体
** 应  用:  
	
**************************** 修改记录 ******************************
** 修改人: 
** 日  期: 
** 描  述: 
********************************************************************/

namespace XClient.Entity.Net
{
    /// <summary>
    /// 网络实体接口，拥有此接口的实体，会在创建的时候主动广播到别的客户端
    /// </summary>
    public interface INetEntity
    {
        /// <summary>
        /// 网络ID
        /// </summary>
        ulong netId { get; }

        /// <summary>
        /// 是否拥有权限进行修改
        /// </summary>
        bool isHasRight { get; }

    }
}
