/*******************************************************************
** 文件名:	SkillObject.cs
** 版  权:	(C) 冰川网络
** 创建人:	许德纪
** 日  期:	2024.6.25
** 版  本:	1.0
** 描  述:	
** 应  用:  技能内部运转对象

**************************** 修改记录 ******************************
** 修改人: 
** 日  期: 
** 描  述: 
********************************************************************/


using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace XClient.Entity
{
    public class SkillObject
    {

    }


}
